Repository: daodreamer/suppuddy
Catalog: suppuddy/Localizable.xcstrings
Source language: en
Languages: de, zh_hans

# 智能提醒
source: Smart Reminders
de: Intelligente Erinnerungen

# 智能提醒功能
source: Smart Reminder Feature
de: Intelligente Erinnerungsfunktion

# 暂停使用补剂 %@
source: Pause Supplement %@
de: Supplement %@ pausieren

# 暂无数据
source: No Data
de: Keine Daten

# 暂无补剂
source: No Supplements
de: Keine Supplemente

# 更改已保存
source: Changes Saved
de: Änderungen gespeichert

# 替换
source: Replace
de: Ersetzen

# 最大安全摄入量:
source: Maximum Safe Intake:
de: Maximale sichere Aufnahme:

# 服用份数
source: Servings Taken
de: Genommene Portionen

# 服用时间
source: Time of Day
de: Tageszeit

# 未设置用户
source: User not set up
de: Benutzer nicht eingerichtet

# 查看今日营养素摄入总结
source: View Today's Nutrient Intake Summary
de: Heutige Nährstoffaufnahme-Zusammenfassung anzeigen

# 查看历史摄入记录
source: View Intake History
de: Einnahmeprotokoll anzeigen

# 查看和编辑个人设置
source: View and edit personal settings
de: Persönliche Einstellungen anzeigen und bearbeiten

# 查看您的摄入量与DGE推荐值的对比
source: View your intake compared to DGE recommendations
de: Vergleichen Sie Ihre Aufnahme mit den DGE-Empfehlungen

# 查看您的营养摄入总览
source: View your nutrient intake overview
de: Überblick über Ihre Nährstoffaufnahme anzeigen

# 查看我的营养推荐值
source: View My Nutrient Recommendations
de: Meine Nährstoffempfehlungen anzeigen

# 欢迎使用 suppuddy
source: Welcome to suppuddy
de: Willkommen bei suppuddy

# 正在处理...
source: Processing...
de: Verarbeitung läuft...

# 正在导出...
source: Exporting...
de: Exportieren läuft...

# 每日推荐值
source: Daily Recommendations
de: Tägliche Empfehlungen

# 添加
source: Add
de: Hinzufügen

# 添加您正在服用的补剂
source: Add supplements you are taking
de: Fügen Sie Ihre Supplemente hinzu

# 添加补剂
source: Add Supplement
de: Supplement hinzufügen

# 点击"完成"按钮开始使用
source: Tap the "Done" button to get started
de: Tippen Sie auf "Fertig", um loszulegen

# 点击添加新的补剂
source: Tap to add a new supplement
de: Tippen Sie, um ein neues Supplement hinzuzufügen

# 点击设置个人信息
source: Tap to set up profile
de: Tippen Sie, um das Profil einzurichten

# 特殊需求
source: Special Needs
de: Besondere Bedürfnisse

# 特殊需求:
source: Special Needs:
de: Besondere Bedürfnisse:

# 用户类型
source: User Type
de: Benutzertyp

# 用户类型:
source: User Type:
de: Benutzertyp:

# 矿物质
source: Minerals
de: Mineralien

# 稳定
source: Stable
de: Stabil

# 管理补剂
source: Manage Supplements
de: Supplemente verwalten

# 类型
source: Type
de: Typ

# 结束日期
source: End Date
de: Enddatum

# 统计信息
source: Statistics
de: Statistiken

# 维生素
source: Vitamins
de: Vitamine

# 编辑
source: Edit
de: Bearbeiten

# 编辑补剂
source: Edit Supplement
de: Supplement bearbeiten

# 编辑补剂 %@
source: Edit Supplement %@
de: Supplement %@ bearbeiten

# 自动计算您的每日营养素总摄入量
source: Automatically calculate your total daily nutrient intake
de: Berechnet automatisch Ihre gesamte tägliche Nährstoffaufnahme

# 营养素
source: Nutrients
de: Nährstoffe

# 营养素信息
source: Nutrient Information
de: Nährstoffinformationen

# 补剂
source: Supplements
de: Supplemente

# 补剂列表
source: Supplement List
de: Supplementliste

# 补剂管理
source: Supplement Management
de: Supplementverwaltung

# 警告
source: Warning
de: Warnung

# 让我们设置您的个人资料，以便为您提供个性化的营养推荐值。
source: Let's set up your profile to provide personalized nutrient recommendations.
de: Lassen Sie uns Ihr Profil einrichten, um personalisierte Nährstoffempfehlungen zu geben.

# 记录
source: Records
de: Aufzeichnungen

# 记录和管理您正在服用的所有补剂产品
source: Record and manage all supplement products you are taking
de: Erfassen und verwalten Sie alle Supplementprodukte, die Sie nehmen

# 记录摄入
source: Record Intake
de: Einnahme aufzeichnen

# 记录摄入后查看趋势
source: View trends after recording intake
de: Trends nach der Einnahme anzeigen

# 记录补剂摄入
source: Record Supplement Intake
de: Supplementeinnahme aufzeichnen

# 记录补剂摄入后查看营养素进度
source: View nutrient progress after recording supplement intake
de: Nährstofffortschritt nach der Supplementeinnahme anzeigen

# 设置
source: Settings
de: Einstellungen

# 设置提醒以保持按时服用
source: Set reminders to maintain on-time intake
de: Erinnerungen einstellen für pünktliche Einnahme

# 设置提醒，确保您按时服用补剂
source: Set reminders to ensure you take supplements on time
de: Legen Sie Erinnerungen fest, um Supplemente rechtzeitig einzunehmen

# 该日期没有摄入记录
source: No intake records for this date
de: Keine Einnahmen für dieses Datum

# 请先添加补剂
source: Please add supplements first
de: Bitte zuerst Supplemente hinzufügen

# 请先选择要导入的文件
source: Please select a file to import first
de: Bitte wählen Sie zuerst eine Importdatei

# 请输入您的名称
source: Please enter your name
de: Bitte geben Sie Ihren Namen ein

# 请输入您的姓名
source: Please enter your full name
de: Bitte geben Sie Ihren vollständigen Namen ein

# 请选择一个补剂
source: Please select a supplement
de: Bitte wählen Sie ein Supplement

# 请选择导入模式
source: Please select an import mode
de: Bitte wählen Sie einen Importmodus

# 跳过
source: Skip
de: Überspringen

# 这些推荐值基于德国营养学会(DGE)的官方标准。
source: These recommendations are based on the official standards of the German Nutrition Society (DGE).
de: Diese Empfehlungen basieren auf den offiziellen Standards der Deutschen Gesellschaft für Ernährung (DGE).

# 这是您可以使用本应用做的事情：
source: Here's what you can do with this app:
de: Das können Sie mit dieser App tun:

# 进展良好
source: Good Progress
de: Guter Fortschritt

# 追踪营养摄入
source: Track Nutrient Intake
de: Nährstoffaufnahme verfolgen

# 选择出生日期
source: Select Date of Birth
de: Geburtsdatum auswählen

# 选择日期范围
source: Select Date Range
de: Datumsbereich auswählen

# 选择补剂
source: Select Supplement
de: Supplement auswählen

# 选择补剂并记录摄入量
source: Select supplement and record intake
de: Supplement auswählen und Einnahme aufzeichnen

# 选择补剂排序方式
source: Select supplement sort order
de: Sortierreihenfolge für Supplemente auswählen

# 重试
source: Retry
de: Wiederholen

# 错误
source: Error
de: Fehler

# 错误：%@
source: Error: %@
de: Fehler: %@

# 首页
source: Dashboard
de: Übersicht

# ，包含%lld种营养素
source: , containing %lld nutrients
de: , enthält %lld Nährstoffe

# ，品牌：%@
source: , brand: %@
de: , Marke: %@

# ，已停用
source: , inactive
de: , inaktiv

# ，每次%@，每天%lld次
source: %1$@ per dose, %2$lld times per day
de: %1$@ pro Dosis, %2$lld mal täglich
zh_hans: ，每次%1$@，每天%2$lld次

source: Barcode: %@
zh_hans: 条形码: %@

source: Information
zh_hans: 信息

source: Name
zh_hans: 名称

source: OK
zh_hans: 确定

# about_version
source: Version 1.0.0
zh_hans: 版本 1.0.0

# button_ok
source: OK
zh_hans: 确定

# nutrient_biotin
source: Biotin
zh_hans: 生物素

# nutrient_calcium
source: Calcium
zh_hans: 钙

# nutrient_magnesium
source: Magnesium
zh_hans: 镁

# nutrient_vitaminA
source: Vitamin A
zh_hans: 维生素A

# nutrient_vitaminB1
source: Vitamin B1 (Thiamin)
zh_hans: 维生素B1 (硫胺素)

# nutrient_vitaminB12
source: Vitamin B12 (Cobalamin)
zh_hans: 维生素B12 (钴胺素)

# nutrient_vitaminB2
source: Vitamin B2 (Riboflavin)
zh_hans: 维生素B2 (核黄素)

# nutrient_vitaminB3
source: Vitamin B3 (Niacin)
zh_hans: 维生素B3 (烟酸)

# nutrient_vitaminC
source: Vitamin C
zh_hans: 维生素C

# nutrient_vitaminD
source: Vitamin D
zh_hans: 维生素D

# nutrient_vitaminE
source: Vitamin E
zh_hans: 维生素E

# nutrient_vitaminK
source: Vitamin K
zh_hans: 维生素K

# offline_icon
source: Offline
zh_hans: 离线
